*                                                                               
*        AVSEDD FÖR HTYP 2239 LEVERANSPLAN SAKNAS                               
*                                                                               
         DBD   NAME=WLXXCS,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCS01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXCS11,PARENT=WLXXCS01,SOURCE=((WDG303,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
