*          DATA SET WLXXKIDII0 AT LEVEL 003 AS OF 90/03/07                      
*                                                                               
         DBD   NAME=WLXXKI,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKI01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKI11,PARENT=WLXXKI01,SOURCE=((WDR190,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
