*          DATA SET WLXXAQDII0 AT LEVEL 002 AS OF 88/05/24                      
*                                                                               
         DBD   NAME=WLXXAQ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAQ01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAQ11,PARENT=WLXXAQ01,SOURCE=((WDG230,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
