*          DATA SET WLXXKPDII0 AT LEVEL 004 AS OF 90/03/23                      
*                                                                               
         DBD   NAME=WLXXKP,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKP01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKP11,PARENT=WLXXKP01,SOURCE=((WDR110,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
