*          DATA SET WLXXKHDII0 AT LEVEL 003 AS OF 90/03/07                      
*                                                                               
         DBD   NAME=WLXXKH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKH01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKH11,PARENT=WLXXKH01,SOURCE=((WDR160,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
