*TRANSPORTREGISTER DISTRIKTSTABELL                                              
*                                                                               
         DBD   NAME=WLXXDM,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDM01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXDM11,PARENT=WLXXDM01,SOURCE=((WDR113,,WDR1))            
         DBDGEN                                                                 
         END                                                                    
