*          DATA SET WLXXKEDII0 AT LEVEL 002 AS OF 90/03/07                      
*                                                                               
         DBD   NAME=WLXXKE,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKE01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKE11,PARENT=WLXXKE01,SOURCE=((WDR150,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
