*          DATA SET WLXXANDII0 AT LEVEL 011 AS OF 87/06/10                      
*                                                                               
         DBD   NAME=WLXXAN,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAN01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAN11,PARENT=WLXXAN01,SOURCE=((WDG250,,WDG2))            
         SEGM  NAME=WLXXAN21,PARENT=WLXXAN11,SOURCE=((WDG251,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
