*                                                                               
         DBD   NAME=WLXXBU,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXBU01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXBU11,PARENT=WLXXBU01,SOURCE=((WDR550,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
