*                                                                               
         DBD   NAME=WLXXMH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXMH01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXMH11,PARENT=WLXXMH01,SOURCE=((WDR115,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
