*                                                                               
*        AVSEDD FÖR HTYP 2241 OMRÄKN TIDISPIN VID R31                           
*                                                                               
         DBD   NAME=WLXXCT,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCT01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXCT11,PARENT=WLXXCT01,SOURCE=((WDG302,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
