*          DATA SET WLXXKVDII0 AT LEVEL 008 AS OF 90/04/03                      
*                                                                               
         DBD   NAME=WLXXKV,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKV01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXKV11,PARENT=WLXXKV01,SOURCE=((WDR450,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
