*                                                                               
         DBD   NAME=WLXXCN,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCN01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXCN11,PARENT=WLXXCN01,SOURCE=((WDR510,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
