*                                                                               
*                                                                               
         DBD   NAME=WLXXDS,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDS01,PARENT=0,SOURCE=((WDG701,,WDG7))                   
         SEGM  NAME=WLXXDS11,PARENT=WLXXDS01,SOURCE=((WDG730,,WDG7))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
