*                                                                               
*                                                                               
         DBD   NAME=WLXXDR,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDR01,PARENT=0,SOURCE=((WDG701,,WDG7))                   
         SEGM  NAME=WLXXDR11,PARENT=WLXXDR01,SOURCE=((WDG740,,WDG7))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
