*          DATA SET WLXXKCDII0 AT LEVEL 003 AS OF 90/03/07                      
*                                                                               
         DBD   NAME=WLXXKC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKC01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKC11,PARENT=WLXXKC01,SOURCE=((WDR130,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
