*          DATA SET WLXXCJDII0 AT LEVEL 003 AS OF 89/10/23                      
*                                                                               
         DBD   NAME=WLXXCJ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCJ01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXCJ11,PARENT=WLXXCJ01,SOURCE=((WDG302,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
