*PACKNING - ORDER UNDER ARBETE                                                  
*                                                                               
         DBD   NAME=WLXXDK,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDK01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXDK11,PARENT=WLXXDK01,SOURCE=((WDR421,,WDR4))            
         SEGM  NAME=WLXXDK21,PARENT=WLXXDK11,SOURCE=((WDR422,,WDR4))            
         DBDGEN                                                                 
         END                                                                    
