*          DATA SET WLXXAUDII0 AT LEVEL 001 AS OF 88/05/17                      
*                                                                               
         DBD   NAME=WLXXAU,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAU01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXAU11,PARENT=WLXXAU01,SOURCE=((WDG390,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
