*                                                                               
         DBD   NAME=WLXXLP,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXLP01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXLP11,PARENT=WLXXLP01,SOURCE=((WDR470,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
