*                                                                               
         DBD   NAME=WLXXLD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXLD01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXLD11,PARENT=WLXXLD01,SOURCE=((WDR180,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
