*                                                                               
         DBD   NAME=WLXXMF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXMF01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXMF11,PARENT=WLXXMF01,SOURCE=((WDR430,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
