*        IDHTYP = 2217 + 2218                                                   
*                                                                               
         DBD   NAME=WLXXBL,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXBL01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXBL11,PARENT=WLXXBL01,SOURCE=((WDR551,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
