*          DATA SET WLXXAODII0 AT LEVEL 002 AS OF 88/09/27                      
*                                                                               
         DBD   NAME=WLXXAO,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAO01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAO11,PARENT=WLXXAO01,SOURCE=((WDG230,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
