*                                                                               
         DBD   NAME=WLXXCO,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCO01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXCO11,PARENT=WLXXCO01,SOURCE=((WDR530,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
