*TRANSPORTREGISTER                                                              
*                                                                               
         DBD   NAME=WLXXDN,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDN01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXDN11,PARENT=WLXXDN01,SOURCE=((WDR116,,WDR1))            
         SEGM  NAME=WLXXDN21,PARENT=WLXXDN11,SOURCE=((WDR117,,WDR1))            
         DBDGEN                                                                 
         END                                                                    
