*          DATA SET WLXXAYDII0 AT LEVEL 004 AS OF 89/03/02                      
*                                                                               
         DBD   NAME=WLXXAY,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAY01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAY11,PARENT=WLXXAY01,SOURCE=((WDG203,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
