*          DATA SET WLXXKUDII0 AT LEVEL 007 AS OF 90/04/03                      
*                                                                               
         DBD   NAME=WLXXKU,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKU01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKU11,PARENT=WLXXKU01,SOURCE=((WDR120,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
