*          DATA SET WLXXDADII0 AT LEVEL 004 AS OF 84/02/10                      
*                                                                               
         DBD   NAME=WLXXDA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDA01,PARENT=0,SOURCE=((WDG701,,WDG7))                   
         SEGM  NAME=WLXXDA11,PARENT=WLXXDA01,SOURCE=((WDG740,,WDG7))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
