*                                                                               
         DBD   NAME=WLXXLU,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXLU01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXLU11,PARENT=WLXXLU01,SOURCE=((WDR470,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
