*                                                                               
*        KVITTNINGSTABELL BYTES                                                 
         DBD   NAME=WLXXCP,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCP01,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WLXXCP11,PARENT=WLXXCP01,SOURCE=((WDR230,,WDR2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
