*          DATA SET WLXXKMDII0 AT LEVEL 002 AS OF 90/03/13                      
*                                                                               
         DBD   NAME=WLXXKM,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKM01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKM11,PARENT=WLXXKM01,SOURCE=((WDR150,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
