*          DATA SET WLXXJYDII0 AT LEVEL 004 AS OF 90/06/05                      
*                                                                               
         DBD   NAME=WLXXJY,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXJY01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXJY11,PARENT=WLXXJY01,SOURCE=((WDR170,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         END                                                                    
