*                                                                               
         DBD   NAME=WLXXAC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAC01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXAC11,PARENT=WLXXAC01,SOURCE=((WDG304,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
